[
  [
    "VOID~n~n~nA short yet difficult Minecraft-graphics raycasting engine coded from ~nscratch in python.~n~nRequires Python 2.7 and Pygame.",
    "",
    "dl/raycaster.zip",
    "images/raycaster.jpg"
  ],
  [
    "Rotoball~n~n~nThe first step in a (hopefully) long journey of Unity projects. ~n~nClassic Atari Breakout but with a 360 degree twist. ~n~nNo download required! ",
    "",
    "unity/rotoball/",
    "images/rotoball.jpg"
  ],
  [
    "Let's Go Bowling~n~n~nSingleplayer bowling with accurate masses and friction. Click, drag, and~nrelease to send the ball flying!~n~nAudio: Jardins du Luxembourg by Jahzzar",
    "",
    "dl/lgb.zip",
    "images/lgb.png"
  ],
  [
    "",
    "",
    "",
    ""
  ],
  [
    "",
    "",
    "",
    ""
  ],
  [
    "",
    "",
    "",
    ""
  ],
  [
    "",
    "",
    "",
    ""
  ],
  [
    "",
    "",
    "",
    ""
  ],
  [
    "",
    "",
    "",
    ""
  ],
  [
    "",
    "",
    "",
    ""
  ],
  [
    "MOB COMBAT TRAINING~n~n~nEntering the arena, you pick up a sword and bow, and prepeare to fight~nto stay alive through this apocalyptic haunted house.~n~nTechnical elements include a custom flushing mob farm, an ilmango mob~nsorter, secondary buffer sorters, piston translocation mob dispensers,~nand a beautiful urban environment to serve as the backdrop.~n~nThis build was inspired by Mumbo Jumbo's Combat Training. I wanted to~nsee what it would take to make one with actual mobs. Turns out it's~nactually quite a lot!~n~nRequires Minecraft 1.10.2",
    "",
    "dl/mob_combat_training.zip",
    "images/mobcombat.jpg"
  ],
  [
    "PORK: A MINECRAFT RUBE GOLDBERG MACHINE~n~n~nA Rube Goldberg Machine built within Minecraft, designed to deliver a~ncooked porkchop to a dinner table at the press of a button.~n~nMusic is Brunch Club (Extended Edition) by Tyler Twombly",
    "https://www.youtube.com/embed/_aMH4KhSP44",
    "dl/rube_goldberg_machine.zip",
    ""
  ],
  [
    "WHAT IS A 60 MINUTE MAP?~n~nA map made in 60 minutes. Each contestant is given a random theme to~nbuild with. They are given 60 minutes. At the end of this time limit,~nthey turn in whatever they have, most of the time to ridiculous results.~nMapmakers CDFDMAN and Recabilly originally coined the concept in 2016.~nSoon after, Rsmalec began his own competition between members of his~ncommunity. I was hooked.~n~nAfter 2 years, here's what I have. It's all in one zip file. Have fun!~n~nIf you would rather watch the video series (I would) I have providied~nthe playlist below.",
    "https://www.youtube.com/embed/videoseries?list=PLX3RuL_SSofWYHe2FMx9G2MfcddVqsDLz",
    "dl/60_minute_maps.zip",
    "images/60mm.jpg"
  ],
  [
    "ST JOSEPHINE'S~n~n~nThe original horror map that started it all.~n~nIn St. Josephine's, you take on the role of the mysterious lawyer John~nDaniels. After your company forecloses on an abandoned hospital, you~nare commissioned to retrieve various articles of paperwork that remain~ninside the building. Getting in is the easy part. Escaping from the~ndark secrets lying within this building will be the real challenge.~n~nA psychological horror map with several jumpscares, puzzles, parkour~nelements, cutscenes, boss battles, custom sounds, a light show, and a~ndeep plotline to tie it all together.~n~nRequires Minecraft 1.8.10",
    "https://www.youtube.com/embed/cahqW_jX4y0",
    "http://adf.ly/1K9fKy",
    "images/st-josephines.jpg"
  ],
  [
    "SKYPILLAR~n~n~nThis is SkyBlock, taken to new heights. A 100 block tall pillar of~nnatural Minecraft terrain that will test your resourcefulness and~nattention to detail as a Minecraft player. The map includes a list of~nchallenges such as creating a nether portal, building a mob grinder,~nand slaying the ender dragon! Supports multiplayer.~n~nRequires Minecraft 1.10.2",
    "",
    "http://adf.ly/1KdTn2",
    "images/skypillar.jpg"
  ],
  [
    "NOTE~n~n~nHow do you describe note?~nNote is a map about loss, but is a story of gain.~nNote is a map about despair, but is a story of hope.~nNote is a map about interaction, but is a story of isolation.~nNote is a map you should play for the story.~n~nA lonely spawn island greets you at the gates of a very unique~nMinecraft server. Communication is blocked, except for notes left by~nplayers on the ground. Prepare for an emotional rollercoaster ride like~nnothing before. Welcome to Note.~n~nNote contains mature themes. This map may not be suitable for younger~nMinecrafters.~n~nRequires Minecraft 1.9.4",
    "https://www.youtube.com/embed/IWb0NG2c3sQ",
    "http://adf.ly/1alEV0",
    "images/note.jpg"
  ],
  [
    "BEYOND PERCEPTION 2~n~n~nCo-developed with the creators of the original map, Beyond Perception~ncomes part two in the series.~n~nThe map uses a mechanic brand new to minecraft, turning the shading~noff. This presents some rather interesting illusions and optical puzzles~nthat will reform everything you know about perspective and shade.~n~nGive it a try at the link below!~n~nRequires Minecraft 1.9.2",
    "https://www.youtube.com/embed/t5-6n2V--xI",
    "http://www.minecraftforum.net/forums/mapping-and-modding/maps/2676688-beyond-perception-2-a-minecraft-visual-puzzle-map",
    "images/beyond2.jpg"
  ],
  [
    "PRESENTABLE LIBERTY~n~n~nYou have been imprisoned without being told why. All you can hear day~nin day out is the faint ticking of a clock in your cell. That is, until~nthe first of 5 fateful days begins.~n~nBased on the original indie game, this map is a complete port of~nWertpol's Masterpiece, complete with updated graphics, 4 unique~nminigames, 275+ block and item models, and all taking place in the same~nrestrictive 2x3 meter room.~n~nRequires Minecraft 1.11.2",
    "https://www.youtube.com/embed/DUvtbOpdrfg",
    "http://adf.ly/1kzvqx",
    "images/presentableliberty.jpg"
  ],
  [
    "",
    "",
    ""
  ],
  [
    "",
    "",
    ""
  ]
]